let pon = prompt(`Як вас звати?`)
 alert(`${pon}, бажаю вам гарного проходження тесту!`)


let x = 0
let name = 0

if(prompt(`Скільки основних еволюцій в пікачу?`)== 2){
	name = name  + 1
	x = x + 1
}
if(prompt(`Скільки основних еволюцій в чармандера?`)== 3){
	name = name  + 1
	x = x + 1
}
if(confirm(`Головного персонажу покемонів звати Еш?`)== true){
	name = name  + 1
	x = x + 1
}
let test = prompt(`В якому році створили прешу серію покемонів?`)
if(test == `1996` || test == `1996р` || test == `1996 рік`){
	name = name  + 2
	x = x + 1
}
if(confirm(`Друга еволюція бульбозавра це Венузавр?`)== false){
	name = name  + 1
	x = x + 1
}
let test1 = prompt(`В якому році створили гру "Pokemon go"?`)
if(test1 == `2016` || test1 == `2016р` || test1 == `2016 рік`){
	name = name  + 2
	x = x + 1
}
if(confirm(`Покемони зроблені в аніме стилі?`) == true){
	name = name  + 1
	x = x + 1
}
if(confirm(`Існують фільми про покемонів?`) == true){
	name = name  + 1
	x = x + 1
}
if(confirm(`Пікачу вогняного типу?`) == false){
	name = name  + 1
	x = x + 1
}
if(prompt(`Cкільки основних еволюцій в гастлі?`) == 3){
	name = name  + 1
	x = x + 1
}
if( name < 6 ){
	alert(`${pon}, тест не складено не складено. Ваш результат - ${name} балів, ви відповіли правльно на ${x} питань і на ${10 - x} неправильно`)
}else if( name < 9 && name > 6 ){
	alert(`${pon}, тест складено задовільно. Ваш результат - ${name} балів, ви відповіли правльно на ${x} питань і на ${10 - x} неправильно`)
}else if( name > 9 || name == 12){
	alert(`${pon}, тест складено відмінно. Ваш результат - ${name} балів, ви відповіли правльно на ${x} питань і на ${10 - x} неправильно`)
}